from units import first_text , add_enteha , add_sarbarg , create_file , recreate_pdf , delete_temp_file ,\
	add_question , add_fourchoice, add_multiparts , add_section


first_text = add_sarbarg(first_text, answertime="۶۰ دقیقه" , examdate= "۱۴۰۳/۰۲/۲۳" , teacher= "محمد صالح علی اکبری" , city= "گناباد", schooltitle="متوسطه دوره دوم", branch= "۱۷۱", school="شاهد امام (ره)" ,grade= "دهم")

first_text = add_question(first_text , "شرکتی به نام «کوروش کمپانی» برای جلب مخاطب یک سری افراد را دعوت کرد و با آن‌ها ویدئوهای تبلیغاتی ساخت. در این کار از کدام یک از فنون اقناع استفاده شده؟" , barom = 1 , khat= 1)
first_text = add_question(first_text , "در یک تبلیغ تلویزیونی برای یک کنسرو لوبیا از فن تداعی  برای اقنا لذت بخش بودن مصرف این محصول استفاده شده. در کنار مصرف این کنسرو طبیعتی سرسبز با رودخانه و دریاچه نمایش داده شد. با توجه به بوم منطقه ما (شهرستان گناباد) یک تبلیغ باز طراحی کنید و از فن تداعی استفاده کنید تا در هنگام یک سفر درون شهرستانی مردم گناباد ترغیب شوند از این کنسرو استفاده کنند." , barom= 3 , khat= 6)
first_text = add_question(first_text , "می‌خواهید برای یک باشگاه ورزشی جدید در گناباد یک تبلیغ آماده کنید. به کمک ترکیبی از فنون اقناع یک تبلیغ جذاب طراحی کنید و سناریو آن را بنویسید.", barom= 5 , khat= 7)
first_text = add_question(first_text , "برای تبلیغ یک محصول آرایشی بهداشتی انواع وسایل از برندهای مختلف را به نمایش می‌گذاریم و یکی را با اثرگذاری زیادی به نمایش می‌گذاریم. توضیح دهید در همچین تبلیغی چه فن‌هایی برای قتاع مخاطب استفاده شده؟", barom= 2 , khat = 4)
first_text = add_question(first_text , "یک اقتصاد دان برای اثبات این که افزایش قیمت بنزین می‌تواند به کشور کمک کند باید مردم کشور را راضی کند تا با افزایش قیمت‌ها کنار بیایند. به او راهکارهایی بر اساس فنون اقناع پیشنهاد دهید تا بتواند در مصاحبه‌ها و سخنرانی‌هایش از آن‌ها استفاده کند تا بتواند این وظیفه‌اش را به انجام رساند.", barom= 4 , khat= 6)
first_text = add_question(first_text , "در دوران جنگ سرد بین اتحادیه جماهیر شوروی و ایالت متحده آمریکا یکی از رقابت‌ها رقابت بر سر قدم گذاشتن بر ماه بود. فرض کنید شما به جای جان اف کندی هستید و دانشمندان ناسا به شما گزارشی تحویل داده اند که می‌گویند رقابت با شوروی و  قدم گذاشتن بر روی ماه برای آن‌ها ممکن نیست. شما چه راهکاری را برنامه ریزی می‌کنید تا در جنگ رسانه‌ای در مقابل شوروی پیروز شوید؟" , barom= 4 , khat = 6)
first_text = add_question(first_text , "می‌خواهیم رستوران داران را از ممنوعیت «مصرف سیگار در رستوران‌ها» منصرف کنیم. چه راهکاری پیشنهاد می‌دهید؟" , barom= 1 , khat = 3)

first_text = add_enteha(first_text)
esm_emtehan = "امتحان تفکر و سواد رسانه‌ای دهم نوبت دوم"
esm_emtehan += ".tex"
create_file(first_text , esm_emtehan)
recreate_pdf(esm_emtehan)
delete_temp_file(esm_emtehan)